MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAM4LS2AA/mcu.h
#define BPM               ((Bpm      *)0x400F0000UL) /**< \brief (BPM) APB Base Address */
#define BPM_ADDR                      (0x400F0000UL) /**< \brief (BPM) APB Base Address */
#define BPM_INST_NUM      1                          /**< \brief (BPM) Number of instances */
#define BPM_INSTS         { BPM }                    /**< \brief (BPM) Instances List */

#define BSCIF             ((Bscif    *)0x400F0400UL) /**< \brief (BSCIF) APB Base Address */
#define BSCIF_ADDR                    (0x400F0400UL) /**< \brief (BSCIF) APB Base Address */
#define BSCIF_INST_NUM    1                          /**< \brief (BSCIF) Number of instances */
#define BSCIF_INSTS       { BSCIF }                  /**< \brief (BSCIF) Instances List */

#define CATB              ((Catb     *)0x40070000UL) /**< \brief (CATB) APB Base Address */
#define CATB_ADDR                     (0x40070000UL) /**< \brief (CATB) APB Base Address */
#define CATB_INST_NUM     1                          /**< \brief (CATB) Number of instances */
#define CATB_INSTS        { CATB }                   /**< \brief (CATB) Instances List */

#define CHIPID            ((Chipid   *)0x400E0400UL) /**< \brief (CHIPID) APB Base Address */
#define CHIPID_ADDR                   (0x400E0400UL) /**< \brief (CHIPID) APB Base Address */
#define CHIPID_INST_NUM   1                          /**< \brief (CHIPID) Number of instances */
#define CHIPID_INSTS      { CHIPID }                 /**< \brief (CHIPID) Instances List */

#define CRCCU             ((Crccu    *)0x400A4000UL) /**< \brief (CRCCU) APB Base Address */
#define CRCCU_ADDR                    (0x400A4000UL) /**< \brief (CRCCU) APB Base Address */
#define CRCCU_INST_NUM    1                          /**< \brief (CRCCU) Number of instances */
#define CRCCU_INSTS       { CRCCU }                  /**< \brief (CRCCU) Instances List */

#define DACC              ((Dacc     *)0x4003C000UL) /**< \brief (DACC) APB Base Address */
#define DACC_ADDR                     (0x4003C000UL) /**< \brief (DACC) APB Base Address */
#define DACC_INST_NUM     1                          /**< \brief (DACC) Number of instances */
#define DACC_INSTS        { DACC }                   /**< \brief (DACC) Instances List */

#define EIC               ((Eic      *)0x400F1000UL) /**< \brief (EIC) APB Base Address */
#define EIC_ADDR                      (0x400F1000UL) /**< \brief (EIC) APB Base Address */
#define EIC_INST_NUM      1                          /**< \brief (EIC) Number of instances */
#define EIC_INSTS         { EIC }                    /**< \brief (EIC) Instances List */

#define HFLASHC           ((Flashcalw *)0x400A0000UL) /**< \brief (HFLASHC) APB Base Address */
#define HFLASHC_ADDR                  (0x400A0000UL) /**< \brief (HFLASHC) APB Base Address */
#define HFLASHC_FROW                  (0x00800200UL) /**< \brief (HFLASHC) FROW Base Address */
#define HFLASHC_FROW_ADDR             (0x00800200UL) /**< \brief (HFLASHC) FROW Base Address */
#define HFLASHC_USER                  (0x00800000UL) /**< \brief (HFLASHC) USER Base Address */
#define HFLASHC_USER_ADDR             (0x00800000UL) /**< \brief (HFLASHC) USER Base Address */
#define FLASHCALW_INST_NUM 1                          /**< \brief (FLASHCALW) Number of instances */
#define FLASHCALW_INSTS   { HFLASHC }                /**< \brief (FLASHCALW) Instances List */

#define FREQM             ((Freqm    *)0x400E0C00UL) /**< \brief (FREQM) APB Base Address */
#define FREQM_ADDR                    (0x400E0C00UL) /**< \brief (FREQM) APB Base Address */
#define FREQM_INST_NUM    1                          /**< \brief (FREQM) Number of instances */
#define FREQM_INSTS       { FREQM }                  /**< \brief (FREQM) Instances List */

#define GLOC              ((Gloc     *)0x40060000UL) /**< \brief (GLOC) APB Base Address */
#define GLOC_ADDR                     (0x40060000UL) /**< \brief (GLOC) APB Base Address */
#define GLOC_INST_NUM     1                          /**< \brief (GLOC) Number of instances */
#define GLOC_INSTS        { GLOC }                   /**< \brief (GLOC) Instances List */

#define GPIO              ((Gpio     *)0x400E1000UL) /**< \brief (GPIO) APB Base Address */
#define GPIO_ADDR                     (0x400E1000UL) /**< \brief (GPIO) APB Base Address */
#define GPIO_INST_NUM     1                          /**< \brief (GPIO) Number of instances */
#define GPIO_INSTS        { GPIO }                   /**< \brief (GPIO) Instances List */

#define HCACHE            ((Hcache   *)0x400A0400UL) /**< \brief (HCACHE) APB Base Address */
#define HCACHE_ADDR                   (0x400A0400UL) /**< \brief (HCACHE) APB Base Address */
#define HCACHE_INST_NUM   1                          /**< \brief (HCACHE) Number of instances */
#define HCACHE_INSTS      { HCACHE }                 /**< \brief (HCACHE) Instances List */

#define HMATRIX           ((Hmatrixb *)0x400A1000UL) /**< \brief (HMATRIX) APB Base Address */
#define HMATRIX_ADDR                  (0x400A1000UL) /**< \brief (HMATRIX) APB Base Address */
#define HMATRIXB_INST_NUM 1                          /**< \brief (HMATRIXB) Number of instances */
#define HMATRIXB_INSTS    { HMATRIX }                /**< \brief (HMATRIXB) Instances List */

#define IISC              ((Iisc     *)0x40004000UL) /**< \brief (IISC) APB Base Address */
#define IISC_ADDR                     (0x40004000UL) /**< \brief (IISC) APB Base Address */
#define IISC_INST_NUM     1                          /**< \brief (IISC) Number of instances */
#define IISC_INSTS        { IISC }                   /**< \brief (IISC) Instances List */

#define PARC              ((Parc     *)0x4006C000UL) /**< \brief (PARC) APB Base Address */
#define PARC_ADDR                     (0x4006C000UL) /**< \brief (PARC) APB Base Address */
#define PARC_INST_NUM     1                          /**< \brief (PARC) Number of instances */
#define PARC_INSTS        { PARC }                   /**< \brief (PARC) Instances List */

#define PDCA              ((Pdca     *)0x400A2000UL) /**< \brief (PDCA) APB Base Address */
#define PDCA_ADDR                     (0x400A2000UL) /**< \brief (PDCA) APB Base Address */
#define PDCA_INST_NUM     1                          /**< \brief (PDCA) Number of instances */
#define PDCA_INSTS        { PDCA }                   /**< \brief (PDCA) Instances List */

